"""
Большое число (bignumber.py)

Вечером ребята решили поиграть в игру "Большое число".
Даны числа. Нужно определить, какое самое большое число можно из них составить.

Формат ввода
В первой строке записано n - количество чисел. Оно не превосходит 100.
Во второй строке через пробел записаны n неотрицательных чисел, каждое из которых не превосходит 1000.

Формат результата
Нужно вывести самое большое число, которое можно составить из данных чисел.

Примеры
3
15 56 2

56215


3
1 783 2

78321


5
2 4 5 2 10

542210


6
9 10 1 1 1 6

9611110


38
82 58 66 34 64 37 40 97 93 52 28 98 90 64 19 22 21 83 56 70 46 17 31 51 55 41 68 18 98 89 88 74 6 6 31 36 35 8

9898979390898888382747068666664645856555251464140373635343131282221191817


100
336 945 741 532 433 309 685 325 572 24 1000 631 675 831 807 134 473 1000 634 748 587 1000 852 353 262 305 243 27 697 919 906 844 938 670 71 843 803 72 180 781 491 379 590 407 233 498 617 533 28 493 542 1000 521 85 373 646 89 799 787 728 148 38 443 559 426 1000 916 866 1000 1000 610 925 882 888 965 317 104 256 976 9 83 415 244 239 1000 68 305 771 734 571 523 574 1000 495 139 94 757 709 573 412

99769659494593892591991690689888882866858528448438383180780379978778177175774874173472872717096976868567567064663463161761059058757457357257155954253353252352149849549349147344343342641541240738379373353336325317309305305282726225624424324239233180148139134104100010001000100010001000100010001000


68
91 1 36 49 66 60 93 59 39 19 19 29 16 3 52 19 75 62 78 10 52 39 34 80 15 36 16 33 56 5 100 7 60 9 45 27 40 85 87 56 24 95 90 77 38 36 52 4 26 42 40 98 25 43 20 39 81 91 4 61 56 43 41 16 29 57 87 99

9999895939191908787858180787777566626160605957565656552525249454443434241404039393938363636343332929272625242019191916161615110100
"""
import functools

def mycmp(a,b):
    return -1 if (a[0]*10**len(b[1])+b[0])>(b[0]*10**len(a[1])+a[0]) else 1

input()
array = [tuple([int(x),x]) for x in input().split(' ')]
array.sort(key=functools.cmp_to_key(mycmp))
print(''.join([x[1] for x in array]),end='')
